insert into klient (klientid, familia,imia,gorod,adres,mail) values
(1,'Коваленко','Кирилл','Казань','ул. Завойского 18','mega123@mail.ru'),
(2,'Сухнев','Данила','Челябинск','ул. Проспект Победы 25','cooldanya@mail.ru'),
(3,'Худяков','Евгений','Челябинск','ул. Проспект Победы 25','evgen@mail.ru'),
(4,'Крохалева','Алена','Казань','ул. Завойского 18','alenak@gmail.ru'),
(5,'Валиев','Ирек','Казань','ул. Глушко 5','VI@gamil.ru'),
(6,'Егоров','Дмитрий','Бакал','ул. Калинина 8','tayota@mail.ru'),
(7,'Киселев','Александр','Екатеринбур','ул. Красноармейская 9','Kis02@mail.ru'),
(8,'Гарфиев','Инсав','Казань','ул. Фучика 72','hockeyman@gmail.ru'),
(9,'Зубенко','Михали','Санкт-Петербург','Адмиралтейский проезд 1','mafioznik@opg.ru'),
(10,'Кочетов','Даниил','Москва','ул. Большая Ордынка 21','footbal@mail.ru');

insert into tovar (tovarid,nazvanie,vid,opisanie,cena) values
(1,'"Байкал 2л"','Газированный напиток','Напиток газированный Байкал напитки из черноголовки, 2 л – легендарный продукт, созданный в 1977 году в качестве альтернативы Coca-Cola.',120),
(2,'"Лимонад Буратино 2л"','Газированный напиток','Лимонад "Буратино" был создан в 1939 году и назван в честь одноименного  сказочного героя. Перед специалистами Института Напитков стояла непростая  задача – создать совершенно новый напиток для советских детей. И вскоре, цель  была достигнута, напиток с цветочно – конфетным вкусом был готов. Согласно  традиционной рецептуре, в состав напитка входили только натуральное  компоненты, натуральные ароматизаторы и лимонно- цитрусовые настои, которые  придавали напитку освежающий эффект и неподражаемый вкус.',105),
(3,'Xiaomi Redmi 9A 32 ГБ, серый','Смартфон','Смартфон Xiaomi Redmi 9A – бюджетная модель, подходящая для использования мессенджеров и интернета. Благодаря процессору и 2 Гб ОЗУ повседневные задачи выполняются без задержек.
Характеристики
диагональ экрана: 6.53";
разрешение экрана: 1600x720;
оперативная память: 2 Гб;
встроенная память: 32 Гб;
класс SIM-карты: Nano-SIM;
емкость аккумулятора: 5000 мАч.',5500),
(4,'Poco POCO C40 4/64GB 4/64 ГБ, черный','Смартфон','Благодаря большому 6,71-дюймовому дисплею HD+, который редко встречается в других моделях, обеспечивается потрясающее качество изображения при просмотре видео.
Высокоемкий аккумулятор 6000 мА·ч обеспечивает сверхдлительное время работы от аккумулятора без подзарядки. Забудьте, что такое разряженный телефон!
Восьмиядерный высокопроизводительный процессор обеспечивает потрясающую производительность и удовлетворяет ваши повседневные потребности без задержек.
Система камер на задней панели обладает мощными возможностями и использует алгоритм оптимизации изображения при помощи ИИ, благодаря чему изображения выглядят более изысканно.
Новый динамичный дизайн и яркие цвета дополняют друг друга. Текстура, напоминающая кожу, обеспечивает необычные ощущения, когда вы держите телефон в руках.',7990),
(5,'Свитшот Tommy Hilfiger','Одежда','Свитшот представляет собой микс толстовки и свитера.
В традиционном исполнении он не имеет капюшона и изготавливается из материала тончайшей вязки.',5900),
(6,'Худи Tommy Jeans','Одежда','Худи – мягкий джемпер, который надевается через голову, с капюшоном и накладным карманом-кенгуру. Название он получил от английского слова hood – «капюшон».',4200),
(7,'Сковорода глубокая с усиленным антипригарным покрытием и индукцией Moulin Villa Raspberry 28 см без крышки','Посуда для приготовления','Яркий малиновый цвет заряжает позитивом и вдохновляет. Сковорода в удобном формате 28 см пригодится большой семье! В ней можно и жарить, и тушить. Она сохранит сочность мяса, рыбы, овощей. Высокие борта делают посуду идеальной для блюд, которые надо готовить с сохранением жидкости. Например, рагу, соусов. Отлично подойдёт для паэльи, плова, пасты. В то же время она хороша для жарки котлет, драников, отбивных, яичницы.',1412),
(8,'Форма порционная для выпечки, запекания и подачи десертов, жульена Доляна "Каспар", рамекин из керамики, 4 шт по 200 мл, размер 9х4,6 см','Посуда для приготовления','Рамекин — это керамическая, стеклянная, стеклокерамическая или фарфоровая форма в виде цилиндра для порционного запекания, объемом от 50 до 300 мл. Рамекины имеют строго одинаковую форму, допускается небольшое расширение кверху.',649),
(9,'Бабочка Morpho adonis в рамке','Украшение настенное интерьерное','В рамке находится настоящая бабочка.
Ареал обитания Южная Америка.
Размер рамки 14х14 см.
Бабочка в рамке
Подходит для подарка и для коллекционирования. Рамку с бабочкой можно повесить на стену и украсить домашний интерьер.',2522),
(10,'Сатурния Павония в рамке','Украшение настенное интерьерное','Настоящая бабочка в рамке
Размер рамки 10х10 см
Павония собрана в Московской области
Настенное украшение
Подарок',1644),
(11,'Игровое компьютерное кресло Бюрократ Zombie Viking 8 черный-красный','Кресло','Бюрократ Zombie 8 - это стильное, удобное и прочное игровое кресло, обивка которого выполнена из искусственной кожи. Продуманная эргономика гарантирует комфортное времяпровождение за компьютером, позволяя сохранить правильную осанку.',7899),
(12,'Офисное кресло Стул Груп Престиж, Ткань, серый','Кресло','Кресло Престиж (Prestige) является очень популярным среди компьютерных и рабочих кресел на протяжении многих лет. Это кресло соединяет в себе такие черты как надежность и простота в сочетании с очень доступной ценой. Практичное и удобное, оно найдет применение в самых разных офисных помещениях и дома.',3699);
delete from zakaztovarov ;
delete from zakaz;

insert into zakaz (zakazid,klientid,data_zakaza,data_dostavki) values
(1,1,current_date,current_date+2),
(2,2,current_date,current_date+5),
(3,3,current_date,current_date+1),
(4,4,current_date,current_date+1),
(5,5,current_date,current_date+10),
(6,6,current_date,current_date+5);

insert into zakaztovarov values 
(1,1),(1,1),(1,10),(1,12),
(2,4),(2,5),
(3,1),(3,2),(3,3),
(4,7),(4,8),
(5,10),(5,10),
(6,11);